In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01 -0.213695  0.289389  1.046332  0.533604
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-03 -1.062021  1.265543  0.160758  2.484335
2013-01-04  3.109458 -0.129769 -1.489388  0.167762
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588
2013-01-06 -1.619917 -0.085948  0.843737 -1.399539

In [10]:
df2 = pd.DataFrame({'A' : 1., 
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D' : np.array([3] * 4, dtype='int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'})

In [11]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df2.<TAB>

SyntaxError: invalid syntax (<ipython-input-13-e8d0e54abc86>, line 1)

In [14]:
df.head()

                   A         B         C         D
2013-01-01 -0.213695  0.289389  1.046332  0.533604
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-03 -1.062021  1.265543  0.160758  2.484335
2013-01-04  3.109458 -0.129769 -1.489388  0.167762
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588

In [15]:
df.tail(3)

                   A         B         C         D
2013-01-04  3.109458 -0.129769 -1.489388  0.167762
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588
2013-01-06 -1.619917 -0.085948  0.843737 -1.399539

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [17]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [18]:
df.values

array([[-0.21369455,  0.2893892 ,  1.04633234,  0.53360404],
       [-1.20192951, -1.03953408,  0.0911507 ,  0.86177209],
       [-1.06202081,  1.26554332,  0.16075815,  2.48433492],
       [ 3.1094577 , -0.12976873, -1.48938771,  0.16776213],
       [ 0.17148962, -0.85001995, -0.12292397, -0.37558824],
       [-1.61991708, -0.085948  ,  0.84373679, -1.39953897]])

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.136102 -0.091723  0.088278  0.378724
std    1.722168  0.832137  0.897495  1.301279
min   -1.619917 -1.039534 -1.489388 -1.399539
25%   -1.166952 -0.669957 -0.069405 -0.239751
50%   -0.637858 -0.107858  0.125954  0.350683
75%    0.075194  0.195555  0.672992  0.779730
max    3.109458  1.265543  1.046332  2.484335

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.213695   -1.201930   -1.062021    3.109458    0.171490   -1.619917
B    0.289389   -1.039534    1.265543   -0.129769   -0.850020   -0.085948
C    1.046332    0.091151    0.160758   -1.489388   -0.122924    0.843737
D    0.533604    0.861772    2.484335    0.167762   -0.375588   -1.399539

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.533604  1.046332  0.289389 -0.213695
2013-01-02  0.861772  0.091151 -1.039534 -1.201930
2013-01-03  2.484335  0.160758  1.265543 -1.062021
2013-01-04  0.167762 -1.489388 -0.129769  3.109458
2013-01-05 -0.375588 -0.122924 -0.850020  0.171490
2013-01-06 -1.399539  0.843737 -0.085948 -1.619917

In [22]:
df.sort(columns='B')

                   A         B         C         D
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588
2013-01-04  3.109458 -0.129769 -1.489388  0.167762
2013-01-06 -1.619917 -0.085948  0.843737 -1.399539
2013-01-01 -0.213695  0.289389  1.046332  0.533604
2013-01-03 -1.062021  1.265543  0.160758  2.484335

In [23]:
df['A']

2013-01-01   -0.213695
2013-01-02   -1.201930
2013-01-03   -1.062021
2013-01-04    3.109458
2013-01-05    0.171490
2013-01-06   -1.619917
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.213695  0.289389  1.046332  0.533604
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-03 -1.062021  1.265543  0.160758  2.484335

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-03 -1.062021  1.265543  0.160758  2.484335
2013-01-04  3.109458 -0.129769 -1.489388  0.167762

In [26]:
df.loc[dates[0]]

A   -0.213695
B    0.289389
C    1.046332
D    0.533604
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.213695  0.289389
2013-01-02 -1.201930 -1.039534
2013-01-03 -1.062021  1.265543
2013-01-04  3.109458 -0.129769
2013-01-05  0.171490 -0.850020
2013-01-06 -1.619917 -0.085948

In [28]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.201930 -1.039534
2013-01-03 -1.062021  1.265543
2013-01-04  3.109458 -0.129769

In [29]:
df.loc['20130102',['A','B']]

A   -1.201930
B   -1.039534
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

-0.21369455489324854

In [31]:
df.at[dates[0], 'A']

-0.21369455489324854

In [32]:
df.iloc[3]

A    3.109458
B   -0.129769
C   -1.489388
D    0.167762
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  3.109458 -0.129769
2013-01-05  0.171490 -0.850020

In [34]:
df.iloc[[1,2,4,],[0,2]]

                   A         C
2013-01-02 -1.201930  0.091151
2013-01-03 -1.062021  0.160758
2013-01-05  0.171490 -0.122924

In [35]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.201930 -1.039534  0.091151  0.861772
2013-01-03 -1.062021  1.265543  0.160758  2.484335

In [36]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.289389  1.046332
2013-01-02 -1.039534  0.091151
2013-01-03  1.265543  0.160758
2013-01-04 -0.129769 -1.489388
2013-01-05 -0.850020 -0.122924
2013-01-06 -0.085948  0.843737

In [37]:
df.iloc[1,1]

-1.0395340846542143

In [38]:
df.iat[1,1]

-1.0395340846542143

In [39]:
df[df.A > 0]

                   A         B         C         D
2013-01-04  3.109458 -0.129769 -1.489388  0.167762
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588

In [40]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.289389  1.046332  0.533604
2013-01-02       NaN       NaN  0.091151  0.861772
2013-01-03       NaN  1.265543  0.160758  2.484335
2013-01-04  3.109458       NaN       NaN  0.167762
2013-01-05  0.171490       NaN       NaN       NaN
2013-01-06       NaN       NaN  0.843737       NaN

In [41]:
df2 = df.copy()

In [42]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [43]:
df2

                   A         B         C         D      E
2013-01-01 -0.213695  0.289389  1.046332  0.533604    one
2013-01-02 -1.201930 -1.039534  0.091151  0.861772    one
2013-01-03 -1.062021  1.265543  0.160758  2.484335    two
2013-01-04  3.109458 -0.129769 -1.489388  0.167762  three
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588   four
2013-01-06 -1.619917 -0.085948  0.843737 -1.399539  three

In [44]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.062021  1.265543  0.160758  2.484335   two
2013-01-05  0.171490 -0.850020 -0.122924 -0.375588  four

In [45]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [46]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df['F']=s1

In [48]:
df.at[dates[0],'A'] = 0

In [49]:
df.iat[0,1] = 0

In [50]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [51]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  1.046332  5 NaN
2013-01-02 -1.201930 -1.039534  0.091151  5   1
2013-01-03 -1.062021  1.265543  0.160758  5   2
2013-01-04  3.109458 -0.129769 -1.489388  5   3
2013-01-05  0.171490 -0.850020 -0.122924  5   4
2013-01-06 -1.619917 -0.085948  0.843737  5   5

In [52]:
df2 = df.copy()

In [53]:
df2[df2 > 0] = -df2

In [54]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.046332 -5 NaN
2013-01-02 -1.201930 -1.039534 -0.091151 -5  -1
2013-01-03 -1.062021 -1.265543 -0.160758 -5  -2
2013-01-04 -3.109458 -0.129769 -1.489388 -5  -3
2013-01-05 -0.171490 -0.850020 -0.122924 -5  -4
2013-01-06 -1.619917 -0.085948 -0.843737 -5  -5

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [56]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [57]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000  1.046332  5 NaN   1
2013-01-02 -1.201930 -1.039534  0.091151  5   1   1
2013-01-03 -1.062021  1.265543  0.160758  5   2 NaN
2013-01-04  3.109458 -0.129769 -1.489388  5   3 NaN

In [58]:
df1.dropna(how='any')

                  A         B         C  D  F  E
2013-01-02 -1.20193 -1.039534  0.091151  5  1  1

In [59]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000  1.046332  5  5  1
2013-01-02 -1.201930 -1.039534  0.091151  5  1  1
2013-01-03 -1.062021  1.265543  0.160758  5  2  5
2013-01-04  3.109458 -0.129769 -1.489388  5  3  5

In [60]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [61]:
df.mean()

A   -0.100487
B   -0.139955
C    0.088278
D    5.000000
F    3.000000
dtype: float64

In [62]:
df.mean(1)

2013-01-01    1.511583
2013-01-02    0.769937
2013-01-03    1.472856
2013-01-04    1.898060
2013-01-05    1.639709
2013-01-06    1.827574
Freq: D, dtype: float64

In [63]:
s = pd.Series([1,3,5,np.nan,6,9], index=dates).shift(2)

In [64]:
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [65]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -2.062021  0.265543 -0.839242   4   1
2013-01-04  0.109458 -3.129769 -4.489388   2   0
2013-01-05 -4.828510 -5.850020 -5.122924   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [66]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000  1.046332   5 NaN
2013-01-02 -1.201930 -1.039534  1.137483  10   1
2013-01-03 -2.263950  0.226009  1.298241  15   3
2013-01-04  0.845507  0.096241 -0.191147  20   6
2013-01-05  1.016997 -0.753779 -0.314070  25  10
2013-01-06 -0.602920 -0.839727  0.529666  30  15

In [67]:
df.apply(lambda x:x.max() - x.min())

A    4.729375
B    2.305077
C    2.535720
D    0.000000
F    4.000000
dtype: float64

In [68]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [69]:
s

0    3
1    2
2    2
3    1
4    3
5    5
6    1
7    3
8    1
9    0
dtype: int32

In [70]:
s.value_counts()

3    3
1    3
2    2
5    1
0    1
dtype: int64

In [71]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [72]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [73]:
df = pd.DataFrame(np.random.randn(10,4))

In [74]:
df

          0         1         2         3
0 -0.199564 -0.601581  0.288403  2.035649
1 -0.336843 -0.204937 -0.149756  0.799891
2  2.253626 -0.360138 -0.105533 -1.318323
3 -0.587094  1.174572  0.743472  1.041932
4 -0.318842  1.318582 -0.730390  1.071925
5 -1.387179  0.908967 -1.290190 -0.640846
6  0.790181 -1.227340  0.721561 -0.033279
7 -0.616580 -0.416180 -0.390540  0.739471
8 -1.015203  1.034027  1.254531 -0.674251
9 -1.833141 -0.456751 -0.184390  1.434462

In [75]:
pieces = [df[:3], df[3:7], df[7:]]

In [76]:
pd.concat(pieces)

          0         1         2         3
0 -0.199564 -0.601581  0.288403  2.035649
1 -0.336843 -0.204937 -0.149756  0.799891
2  2.253626 -0.360138 -0.105533 -1.318323
3 -0.587094  1.174572  0.743472  1.041932
4 -0.318842  1.318582 -0.730390  1.071925
5 -1.387179  0.908967 -1.290190 -0.640846
6  0.790181 -1.227340  0.721561 -0.033279
7 -0.616580 -0.416180 -0.390540  0.739471
8 -1.015203  1.034027  1.254531 -0.674251
9 -1.833141 -0.456751 -0.184390  1.434462

In [77]:
left = pd.DataFrame({'key':['foo', 'foo'], 'lval': [1, 2]})

In [78]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval':[4, 5]})

In [79]:
left

   key  lval
0  foo     1
1  foo     2

In [80]:
right

   key  rval
0  foo     4
1  foo     5

In [81]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [82]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])

In [83]:
df

          A         B         C         D
0  0.076015  1.629523  1.464369 -0.274841
1 -0.299600  0.517737  1.691421  0.116647
2 -0.611181  0.961659 -1.312884  0.291691
3 -0.017492 -0.333539 -2.181485 -0.162062
4  1.181150 -0.295771  0.608346  0.220900
5  0.485532  1.940850  0.145523 -0.296943
6 -0.239568 -1.126640 -0.816210 -0.451975
7  2.126411 -1.271707 -2.509591 -0.375926

In [84]:
s = df.iloc[3]

In [85]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.076015  1.629523  1.464369 -0.274841
1 -0.299600  0.517737  1.691421  0.116647
2 -0.611181  0.961659 -1.312884  0.291691
3 -0.017492 -0.333539 -2.181485 -0.162062
4  1.181150 -0.295771  0.608346  0.220900
5  0.485532  1.940850  0.145523 -0.296943
6 -0.239568 -1.126640 -0.816210 -0.451975
7  2.126411 -1.271707 -2.509591 -0.375926
8 -0.017492 -0.333539 -2.181485 -0.162062

In [86]:
df = pd.DataFrame({'A':['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B':['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)})

In [87]:
df

     A      B         C         D
0  foo    one  0.051400 -0.481227
1  bar    one  1.058719  1.414569
2  foo    two  2.262420  0.816973
3  bar  three -0.274024 -1.140486
4  foo    two -0.355108  0.338238
5  bar    two  0.168318 -0.970248
6  foo    one -0.042617  0.177935
7  foo  three -1.071298  1.845970

In [88]:
df.groupby('A').sum()

            C         D
A
bar  0.953013 -0.696164
foo  0.844798  2.697888

In [89]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.058719  1.414569
    three -0.274024 -1.140486
    two    0.168318 -0.970248
foo one    0.008783 -0.303293
    three -1.071298  1.845970
    two    1.907313  1.155210

In [90]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))

In [92]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [94]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [95]:
df2 = df[:4]

In [96]:
df2

                     A         B
first second
bar   one    -0.453445 -0.632796
      two    -0.501049 -0.882170
baz   one     0.705313  0.049555
      two    -0.824171  1.501639

In [97]:
stacked = df2.stack()

In [98]:
stacked

first  second
bar    one     A   -0.453445
               B   -0.632796
       two     A   -0.501049
               B   -0.882170
baz    one     A    0.705313
               B    0.049555
       two     A   -0.824171
               B    1.501639
dtype: float64

In [99]:
stacked.unstack()

                     A         B
first second
bar   one    -0.453445 -0.632796
      two    -0.501049 -0.882170
baz   one     0.705313  0.049555
      two    -0.824171  1.501639

In [100]:
stacked.unstack(1)

second        one       two
first
bar   A -0.453445 -0.501049
      B -0.632796 -0.882170
baz   A  0.705313 -0.824171
      B  0.049555  1.501639

In [101]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.453445  0.705313
       B -0.632796  0.049555
two    A -0.501049 -0.824171
       B -0.882170  1.501639

In [102]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [103]:
df

        A  B    C         D         E
0     one  A  foo  0.123756 -0.256999
1     one  B  foo -0.187675 -1.672270
2     two  C  foo -1.523793  0.071092
3   three  A  bar  1.238467  2.183415
4     one  B  bar -2.288592  0.753893
5     one  C  bar -0.751252  0.369152
6     two  A  foo  0.860258  0.775663
7   three  B  foo -1.997365  0.562978
8     one  C  foo  0.373421 -0.546764
9     one  A  bar -0.200462  0.912204
10    two  B  bar -0.450977 -0.367098
11  three  C  bar  1.023479 -1.138569

In [105]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.200462  0.123756
      B -2.288592 -0.187675
      C -0.751252  0.373421
three A  1.238467       NaN
      B       NaN -1.997365
      C  1.023479       NaN
two   A       NaN  0.860258
      B -0.450977       NaN
      C       NaN -1.523793

In [106]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')